

//      =========  Модификаторы класса для членов класса      =====


// 1. private


// 2. protected

// 3. internal               (как паблик но публичный только внутри сборки)

// 4. public

// 5. private protected       (видин только наследнику в текущей сборке) 
// (private public)

// 6. protected internal       (всем внутри текущей сборки, ля наследников во внешних сборках) 
//                             (protected public)



// ============= модификаторы для типа в целом ================

// 1. internal

// 2. public

// 3. file